Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: A collection whose elements are all identical.
ja: あるコレクション、その要素は全て同一です。

source: A collection whose elements are key-value pairs.
ja: それの要素がキー値ペアであるコレクション。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be non-uniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが特有にでなくとも参照されるようにします。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be nonuniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが非特有に参照されるようにします。

source: A common timing mistake is expecting the results of an asynchronous call to be available within the calling synchronous code.
ja: よくあるタイミング間違いは、非同期呼び出しの結果が、呼び出している同期的コード内部で利用可能であると予想することです。

source: A concrete container that provides a view into a decoder’s storage, making the encoded properties of a decodable type accessible by keys.
ja: ある具体的なコンテナで、あるデコーダの持つストレージへのビューを提供します、デコーダ可能型のエンコードされたプロパティをキーによってアクセス可能にしています。

source: A concrete container that provides a view into an encoder’s storage, making the encoded properties of an encodable type accessible by keys.
ja: ある具体的なコンテナで、あるエンコーダの持つストレージへのビューを提供します、エンコード可能型のエンコードされたプロパティをキーによってアクセス可能にしています。

source: A conforming sequence that is not a collection is allowed to produce an arbitrary sequence of elements in the second for-in loop.
ja: 準拠しているシーケンスでコレクションではないものは、２番目のfor-inループにおいて幾つかの要素からなる随意のシーケンスを生み出すことを許可されます。

source: A container that can support the storage and direct decoding of a single nonkeyed value.
ja: 単一非キー値のストレージおよび直接デコーディングをサポートできるコンテナ。

source: A container that can support the storage and direct encoding of a single non-keyed value.
ja: 単一非キー値のストレージおよび直接エンコーディングをサポートできるコンテナ。

source: A custom RandomNumberGenerator type can have different characteristics than the default SystemRandomNumberGenerator type.
ja: あつらえのRandomNumberGenerator型は、省略時のSystemRandomNumberGenerator型とは異なる特徴を持つことができます。

source: A custom playground Quick Look for the Int64 instance.
ja: Int64インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Int8 instance.
ja: Int8インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A decoded value of the requested type, or nil if the Decoder does not have an entry associated with the given key, or if the value is a null value.
ja: 要求された型にデコード済みの値、またはnil、もしDecoderが与えられたキーに関連する登録項目を持たない場合は、またはその値がnull値の場合は。

source: A dictionary literal to use as the structure for the mirror.
ja: ミラーのための構造体として使うことになる辞書リテラル。

source: A failure, storing a Failure value.
ja: ある失敗、Failure値を格納しています。

source: A flattened view of the elements of this sequence of sequences.
ja: 複数のシーケンスからなるこのシーケンスの要素のある平坦なビュー。

source: A floating-point value to convert to an integer.
ja: 整数へと変換する浮動小数点値．

source: A four-element vector created by appending a scalar to a three-element vector.
ja: あるスカラーを３要素ベクターに追加することによって作成される４要素ベクター。

source: A function that produces the initial Header instance stored in the buffer, given the buffer object and a function that can be called on it to get the actual number of allocated elements.
ja: バッファに格納される初期Headerインスタンスを生成する関数、bufferオブジェクトおよびそれの上で呼び出されて割り当てられた要素の実際の数を得る関数を与えられます。

source: A half-length vector made up of the even elements of the vector.
ja: ベクターの偶数番目の要素から作り上げられる半分長のベクター。

source: A half-length vector made up of the high elements of the vector.
ja: ベクターの高い方の要素からから作り上げられる半分長のベクター。

source: A half-length vector made up of the low elements of the vector.
ja: ベクターの低い方の要素からから作り上げられる半分長のベクター。

source: A half-length vector made up of the odd elements of the vector.
ja: ベクターの奇数番目の要素から作り上げられる半分長のベクター。

source: A half-open interval from a lower bound up to, but not including, an upper bound.
ja: 下側の境界から、上側の境界まで、しかしそれを含んでいない、半開間隔。

source: A key path from a specific root type to a specific resulting value type.
ja: 特定の根本の型から特定の結果値の型へのキーパス。

source: A key path referring to storage that can be accessed through a value of type T.
ja: 型Tの値を通してアクセス可能なストレージを参照しているキーパス。

source: A key path that supports reading from and writing to the resulting value with reference semantics.
ja: 結果値からのよみ出し及びそれへの書き込みを参照意味論でサポートするキーパス。

source: A key path that supports reading from and writing to the resulting value.
ja: 結果値からのよみ出し及びそれへの書き込みをサポートするキーパス。

source: A keyed decoding container view into self.
ja: selfへのキー付きデコーディングコンテナビュー。

source: A lazy Collection wrapper that includes the elements of an underlying collection that satisfy a predicate.
ja: 遅延なCollectionラッパー、それは根底にあるコレクションの要素のうち、ある述部を満足させるものを含めます。

source: A lazy collection wrapper that includes the initial consecutive elements of an underlying collection that satisfy a predicate.
ja: 遅延collectionラッパー、それは根底にあるコレクションのうち、ある述部を満足させる、最初の連続した要素を含みます。

source: A lazy wrapper that includes the elements of an underlying collection after any initial consecutive elements that satisfy a predicate.
ja: 遅延なラッパー、それは根底にあるコレクションのうち、ある述部を満足させる何らかの最初の連続した要素の後ろの要素らを含みます。

source: A lightweight collection of key-value pairs.
ja: キー値ペアの軽量コレクション。

source: A list of elements of the new set.
ja: 新しい集合の要素のリスト。

source: A mapping closure.
ja: マップを行うクロージャ。

source: A member of the set.
ja: 集合の中のひとつのメンバ。

source: A mirror describes the parts that make up a particular instance, such as the instance’s stored properties, collection or tuple elements, or its active enumeration case.
ja: ミラーは様々な部分を叙述します、それらはある特定のインスタンスを作り上げるものです、例えばそのインスタンスのもつ格納プロパティ、コレクションまたはタプルの要素、またはそれの動的列挙ケース節など。

source: A mirror of the subject’s superclass, if one exists.
ja: 主題の持つスーパークラスのミラー、もしそれが存在するならば。

source: A mirror that reflects the Int64 instance.
ja: Int64インスタンスを反映するミラー。

source: A mirror that reflects the Int8 instance.
ja: Int8インスタンスを反映するミラー。

source: A mirror that reflects the iterator.
ja: そのイテレータを反映するミラー。

source: A mirror that reflects the set.
ja: その集合を反映するミラー。

source: A mutable pointer addressing an Objective-C reference that doesn’t own its target.
ja: それのターゲットを所有しないObjective-C参照をアドレス指定している可変ポインタ。

source: A new Decoder to pass to super.init(from:).
ja: super.init(from:)に渡すための新しいDecoder。

source: A new encoder to pass to super.encode(to:).
ja: super.encode(to:)に渡すための新しいエンコーダ。

source: A new instance initialized with rawValue will be equivalent to this instance.
ja: rawValueで初期化された新しいインスタンスは、このインスタンスに相当します。

source: A new keyed encoding container.
ja: 新しいキー付けされるエンコーディングコンテナ。

source: A new option set made up of the elements contained in this set, in other, or in both.
ja: この集合の中に、otherの中に、または両方の中に含まれる要素から作り上げられるオプションセット。

source: A new option set with only the elements contained in both this set and other.
ja: この集合とotherの両方に含まれる要素のみをもつ新しいオプションセット。

source: A new option set with only the elements contained in either this set or other, but not in both.
ja: この集合またはotherのどちらかに、しかし両方にではなく含まれる要素のみをもつ新しいオプションセット。

source: A new range clamped to the bounds of limits.
ja: limitsの境界内に制限された、新しい範囲。

source: A new set with the unique elements of this set and other.
ja: この集合とotherとの特有な要素を持つ新しい集合。

source: A new set.
ja: 新しい集合。

source: A new unkeyed encoding container.
ja: 新しいキー付けされないエンコーディングコンテナ。

source: A numeric value.
ja: ある数値。

source: A partial half-open interval up to, but not including, an upper bound.
ja: 上側の境界までの、しかしそれを含まない部分的半開間隔。

source: A partial interval extending upward from a lower bound.
ja: ある下側の境界から上向きに拡張する部分的な間隔。

source: A partial interval up to, and including, an upper bound.
ja: ある上側の境界までの、そしてそれを含んでいる部分的な間隔。

source: A partially type-erased key path, from a concrete root type to any resulting value type.
ja: ある部分的な型消去キーパス、具体的な根本の型から何らかの結果値の型への。

source: A position in a LazyPrefixWhileCollection or LazyPrefixWhileBidirectionalCollection instance.
ja: LazyPrefixWhileCollectionまたはLazyPrefixWhileBidirectionalCollectionインスタンスの中のある位置。

source: A predicate that returns true if its first argument should be ordered before its second argument; otherwise, false.
ja: ある述部、それはそれの最初の引数がそれの２番目の引数の前に並べられるべきならばtrueを返します；そうでなければ、false。

source: A predicate that returns true if its two arguments are equivalent; otherwise, false.
ja: ある述部、それはそれの２つの引数が等しいならばtrueを返します；そうでなければ、false。

source: A predicate used to partition the collection.
ja: コレクションに仕切りをするのに使われる述部。

source: A property has inline, directly addressable storage when it is a stored property for which no additional work is required to extract or set the value.
ja: あるプロパティは、インラインに、直接にアドレス指定可能なストレージを持ちます、それが値を抽出または設定するのに追加的な仕事が要求されない格納プロパティである場合は。

source: A protocol for legitimate arguments to Mirror’s descendant method.
ja: Mirrorのdescendantメソッドへの合法的な引数に対するプロトコル。

source: A random element from the collection.
ja: このコレクションからのある無作為の要素。

source: A random value of T in the range 0..Bound.
ja: ある無作為なTの値で範囲0..Boundの中のもの。

source: A random value of T.
ja: ある無作為なTの値。

source: A random value within the bounds of range.
ja: rangeの境界内のある無作為な値。

source: A range expression that represents the entire range of a collection.
ja: あるコレクションの全体の範囲を表す範囲式。

source: A range of the collection’s indices.
ja: コレクションのもつインデックスのある範囲。

source: A range of the range’s indices.
ja: この範囲のインデックスの範囲。

source: A range suitable for slicing collection.
ja: スライスするcollectionに対して適している範囲。

source: A range to check for elements in common.
ja: 共通の要素を調べる範囲。

source: A range to compare.
ja: 比較する範囲。

source: A range-replaceable collection.
ja: 範囲置換可能なコレクション。

source: A range.
ja: 範囲。

source: A reimagined Swift computed property that expresses the same functionality—getting the components of a color—can be written as a four-element tuple:
ja: 再度考えられたSwift計算プロパティで同じ機能性を表現するもの — ある色の構成要素の取得 — は、４要素のタプルとして記述されることができます：

source: A representation of the substructure and display style of an instance of any type.
ja: 下位構造体の表現と何らかの型のインスタンスの表示形式。

source: A representation of this integer with the byte order swapped.
ja: この整数のバイト順交換した表現。

source: A sequence built around an iterator of type Base.
ja: 型Baseのイテレータに基づいて構築されるシーケンス。

source: A sequence consisting of all the elements contained in each segment contained in some Base sequence.
ja: 何らかのBaseシーケンスに含まれる各断片の中に含まれるいくらかの要素から成るシーケンス。

source: A sequence containing the same elements as a Base sequence, but on which some operations such as map and filter are implemented lazily.
ja: Baseシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence containing the same elements as this one, possibly with a simpler type.
ja: このものと同じ要素を、できる限りより簡単な型で、含むシーケンス。

source: A sequence containing the same elements as this sequence, but on which some operations, such as map and filter, are implemented lazily.
ja: このシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence is a list of values that you can step through one at a time.
ja: シーケンスは値のリストで、あなたが一度に１つずつ段階処理していくことができるものです。

source: A sequence leaving off the specified number of elements.
ja: 指定された数の要素を取り除いたあるシーケンス。

source: A sequence of elements.
ja: いくつかの要素からなるシーケンス。

source: A sequence of pairs built out of two underlying sequences.
ja: ２つの根底にあるシーケンスから組み立てられるペアからなるシーケンス。

source: A sequence of pairs enumerating the sequence.
ja: このシーケンスを列挙している、ペアからなるあるシーケンス。

source: A sequence of the initial, consecutive elements that satisfy predicate.
ja: predicateを満たす冒頭の、隣接する要素からなるあるシーケンス。

source: A sequence of values formed by striding over a closed interval.
ja: ある完結間隔の全体をまたぐことで形成されるいくつかの値からなるシーケンス。

source: A sequence of values formed by striding over a half-open interval.
ja: ある半開間隔の全体をまたぐことで形成されるいくつかの値からなるシーケンス。

source: A sequence on which normally-eager sequence operations are implemented lazily.
ja: あるシーケンス、それにおいては通常は先行な演算は、遅延に実装されます。

source: A sequence should provide its iterator in O(1).
ja: シーケンスはそれのイテレータをO(1)で提供すべきです。

source: A sequence starting after the initial, consecutive elements that satisfy predicate.
ja: predicateを満たす冒頭の、隣接する要素の後で始まるあるシーケンス。

source: A sequence starting after the specified number of elements.
ja: 指定された数の要素の後で始まるシーケンス。

source: A sequence starting at the beginning of this sequence with at most maxLength elements.
ja: このシーケンスの先端で始まる多くともmaxLength要素のあるシーケンス。

source: A sequence that lazily consumes and drops n elements from an underlying Base iterator before possibly returning the first available element.
ja: おそらくは最初の利用可能な要素が返る前にn個の要素をある基礎をなすBaseイテレータから遅延に消費して落とすあるシーケンス。

source: A sequence that only consumes up to n elements from an underlying Base iterator.
ja: 最大でn個の要素まで基礎をなすBaseイテレータからただ消費しきるあるシーケンス。

source: A sequence that presents the elements of a base sequence of sequences concatenated using a given separator.
ja: あるシーケンス、それはいくらかのシーケンスからなるある基盤となるシーケンスの要素らを、与えられた分離子を使って連結して提示します。

source: A sequence that represents a contiguous subrange of the collection’s elements.
ja: コレクションの要素の隣接下位範囲を表すシーケンス。

source: A sequence to compare to this sequence.
ja: あるシーケンス、このシーケンスと比べることになります。

source: A sequence to insert between each of this sequence’s elements.
ja: このシーケンスの要素それぞれの間に挿入されるシーケンス。

source: A sequence whose elements are produced via repeated applications of a closure to some mutable state.
ja: あるクロージャをある何らかの可変の状態へ繰り返し適用することでその要素が生み出されるシーケンス。

source: A sequence whose elements can be traversed multiple times, nondestructively, and accessed by an indexed subscript.
ja: あるシーケンス、それの要素は複数回探査されることが非破壊的に可能です、そしてある添え字で指し示すことによってアクセスされることが可能です。

source: A sequence whose elements consist of the elements of some base sequence that also satisfy a given predicate.
ja: あるシーケンス、それは何らかの基盤シーケンスの要素でさらにまた与えられた述部を満足させるものから成る要素たちです。

source: A sequence whose elements consist of the elements that follow the initial consecutive elements of some base sequence that satisfy a given predicate.
ja: あるシーケンス、それの要素は何らかの基盤シーケンスの、ある与えられた述部を満足させる最初の隣接要素の後に続く要素それらから成ります。

source: A sequence whose elements consist of the initial consecutive elements of some base sequence that satisfy a given predicate.
ja: あるシーケンス、それの要素は何かの基盤シーケンスのもので、与えられた述部を満足させる最初の連続した要素から成ります。

source: A service which can execute jobs.
ja: ジョブを遂行できるあるサービス。

source: A set of the elements that isIncluded allows.
ja: isIncludedが許可する要素からなる集合。

source: A set of the same type as the current set.
ja: 現在の集合と同じ型の集合。

source: A set of the same type.
ja: 同じ型の集合。

source: A set.
ja: １つの集合。

source: A shuffled array of this sequence’s elements.
ja: このシーケンスの持つ要素からなる、あるシャッフルされた配列。

source: A single, concatenated string.
ja: 単一の、連結された文字列。

source: A singleton actor whose executor is equivalent to the main dispatch queue.
ja: あるシングルトンアクター、それのエグゼキュータはメインディスパッチキューと同等です。

source: A sink subscriber connected to the result’s publisher receives the output 1, followed by a normal completion (Subscribers.Completion.finished).
ja: 結果のもつパブリッシャーに接続した流し先の加入者は出力1、それに続けてある正常完了（Subscribers.Completion.finished）を受け取ります。

source: A sink subscriber connected to this result’s publisher immediately receives a termination (Subscribers.Completion.failure(_:)).
ja: 結果のもつパブリッシャーに接続した流し先の加入者は、直ぐにある終了（Subscribers.Completion.failure(_:)）を受け取ります。

source: A sorted array of the sequence’s elements.
ja: このシーケンス要素のソート済み配列。

source: A stable sort preserves the relative order of elements for which areInIncreasingOrder does not establish an order.
ja: 安定ソートは、それに対してareInIncreasingOrderが順序を確立しない要素らの相対順序を保存します。

source: A stable sort preserves the relative order of elements that compare equal.
ja: 安定ソートは、等しいと比較される要素それらの相対順序を保存します。

source: A string that represents the contents of the dictionary, suitable for debugging.
ja: 辞書の内容を表す文字列、デバッグに適するもの。

source: A string that represents the contents of the dictionary.
ja: 辞書の内容を表す文字列。

source: A string that represents the contents of the set, suitable for debugging.
ja: 集合の内容を表す文字列、デバッグに適するもの。

source: A string that represents the contents of the set.
ja: 集合の内容を表す文字列。

source: A string to insert between each of the elements in this sequence.
ja: このシーケンスの要素のそれぞれの間に挿入されることになる文字列。

source: A string, formatted according to the default list format style.
ja: ある文字列、それは省略時のリスト書式形式により書式設定されます。

source: A string, formatted according to the provided style.
ja: ある文字列、提供された形式により書式設定されます。

source: A subsequence starting after the specified number of elements.
ja: 指定された数の要素の後から始まる下位シーケンス。

source: A subsequence starting at the start position.
ja: start位置から始まる下位シーケンス。

source: A subsequence starting at the beginning of this collection with at most maxLength elements.
ja: このコレクションの先端で始まる多くともmaxLength要素の下位シーケンス。

source: A subsequence terminating at the end of the collection with at most maxLength elements.
ja: コレクションの末端で終わっていて多くともmaxLengthの要素を持つ下位シーケンス。

source: A subsequence that leaves off k elements from the end.
ja: k個の要素を終わりから取り除いた下位シーケンス。

source: A subsequence that leaves off the specified number of elements at the end.
ja: 指定された数の要素が末尾から無くなっているシーケンス。

source: A subsequence up to, and including, the end position.
ja: end位置に至るまでの、そしてそれを含む、下位シーケンス。

source: A subsequence up to, but not including, the end position.
ja: end位置に至るまでの、しかしそれを含まないシーケンス。

source: A success, storing a Success value.
ja: ある成功、Success値を格納しています。

source: A suggested display style for the reflected subject.
ja: リフレクションされる主題のための１つの提案の表示形式。

source: A suggestion of how a mirror’s subject is to be interpreted.
ja: どのようにMirrorの持つsubjectが解釈されるようになるかの提案。

source: A textual description of the vector.
ja: ベクターのテキスト記述。

source: A textual representation of the identifier, suitable for debugging.
ja: その識別子のテキスト表現、デバッグに適するもの。

source: A textual representation of the pointer, suitable for debugging.
ja: そのポインタのテキスト表現、デバッグに適するもの。

source: A textual representation of the range, suitable for debugging.
ja: 範囲のテキスト表現、デバッグに適するもの。

source: A textual representation of the range.
ja: 範囲のテキスト表現。

source: A textual representation of this instance, suitable for debugging.
ja: そのインスタンスのテキスト表現、デバッグに適するもの。

source: A textual representation of this instance.
ja: このインスタンスのテキスト表現。

source: A textual representation of this value.
ja: この値のテキスト表現。

source: A three-element vector created by appending a scalar to a two-element vector.
ja: あるスカラーを２要素ベクターに追加することによって作成される３要素ベクター。

source: A throwing closure to evaluate.
ja: 評価することになるスローするクロージャ。

source: A timing scenario you should avoid is calling the dataTask(with:completionHandler:) method within your app's viewDidLoad() method and attempting to use the results outside of the closure you pass as the completion handler.
ja: あなたが避けるべきタイミングシナリオは、dataTask(with:completionHandler:)メソッドをあなたのアプリのviewDidLoad()メソッド内部で呼び出す、そして結果をあなたが完了ハンドラとして渡したクロージャの外部で使うのを試みることです。

source: A tuple containing the high and low parts of a double-width integer.
ja: ２倍幅整数の高および低部分を含んでいるタプル。

source: A tuple containing the high and low parts of the result of multiplying this value and other.
ja: この値とotherを乗算する結果の高および低部分を含んでいるタプル。

source: A tuple containing the quotient and remainder of dividend divided by this value.
ja: dividendをこの値で除算した商と余りを含んでいるタプル。

source: A tuple containing the quotient and remainder of this value divided by rhs.
ja: rhsによって除算されたこの値の商と余りを含んでいるタプル。

source: A tuple containing the result of the addition along with a Boolean value indicating whether overflow occurred.
ja: 加算の結果とそれだけでなくオーバーフローがその演算において起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the division along with a Boolean value indicating whether overflow occurred.
ja: 除算の結果とそれだけでなくオーバーフローがその演算において起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the multiplication along with a Boolean value indicating whether overflow occurred.
ja: 乗算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the operation along with a Boolean value indicating whether overflow occurred.
ja: 演算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the subtraction along with a Boolean value indicating whether overflow occurred.
ja: 減算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple of the lower and upper bounds of the range.
ja: この範囲の下方および上方境界からなるタプル。

source: A type for which the conforming type provides a containment test.
ja: ある型、それに対して準拠しているが格納テストを提供します。

source: A type representing an error value that can be thrown.
ja: スローされることが可能なあるエラー値を表している型。

source: A type representing continuous, one-dimensional values that can be offset and measured.
ja: オフセットできて計測できる、連続的な、一次元の値を表している型。

source: A type representing the sequence’s elements.
ja: このシーケンスの持つ要素を表している型。

source: A type representing the stable identity of the entity associated with an instance.
ja: あるインスタンスと結び付けられた登録項目の安定した同一性を表しているある型。

source: A type that can be converted to and from an associated raw value.
ja: ある結び付けられた生の値へおよびそれから変換できる型。

source: A type that can be represented as a string in a lossless, unambiguous way.
ja: あるロスレスの、曖昧さのない方法で、文字列として表現できる型。

source: A type that can be used as an element in a SIMD vector.
ja: SIMDベクターにおける要素として使用できるある型。

source: A type that can be used to slice a collection.
ja: コレクションをスライスするために使われる型。

source: A type that can function as storage for a SIMD vector type.
ja: ある型、それは、SIMDベクター型に対するストレージとして機能できるものです。

source: A type that can represent both positive and negative values.
ja: 正と負の値の両方を表せる型。

source: A type that can represent the absolute value of any possible value of the conforming type.
ja: 準拠する型の何らかの可能な値の絶対値を表すことのできる型。

source: A type that can represent the absolute value of any possible value of this type.
ja: この型の何らかの可能な値の絶対値を表すことのできる型。

source: A type that conforms to RangeExpression can convert itself to a Range<Bound> of indices within a given collection.
ja: RangeExpressionに準拠する型は、それ自身を指定コレクション内のインデックスのRange<Bound>に変換できます。

source: A type that conforms to RangeReplaceableCollection can choose how to respond when this method is called.
ja: RangeReplaceableCollectionに準拠する型は、このメソッドが呼ばれた時どのような応答をするか選ぶことができます。

source: A type that explicitly supplies its own mirror, but whose descendant classes are not represented in the mirror unless they also override customMirror.
ja: 明示的にそれ独自のMirrorを提供するある型、しかしそれの子孫クラスはそれらがまたcustomMirrorをオーバーライドしない限りはMirrorで表現されません。

source: A type that explicitly supplies its own mirror.
ja: 明示的にそれ自身のMirrorを提供する型。

source: A type that iterates over a collection using its indices.
ja: あるコレクション全体に渡ってそれのインデックスを使って繰り返し処理する型。

source: A type that presents a mathematical set interface to a bit set.
ja: 数学的なセットインターフェイスをビットセットに与える型。

source: A type that provides a collection of all of its values.
ja: それの値の全てからなるコレクションを提供する型。

source: A type that provides a view into a decoder’s storage and is used to hold the encoded properties of a decodable type in a keyed manner.
ja: ある型で、あるデコーダの持つストレージへのビューを提供し、そしてデコーダ可能型のエンコードされたプロパティをキー流儀で保持するために使われます。

source: A type that provides a view into a decoder’s storage and is used to hold the encoded properties of a decodable type sequentially, without keys.
ja: ある型で、あるデコーダの持つストレージへのビューを提供し、そしてデコーダ可能型のエンコードされたプロパティを順次的に、キーなしで保持するために使われます。

source: A type that provides a view into an encoder’s storage and is used to hold the encoded properties of an encodable type in a keyed manner.
ja: ある型で、あるエンコーダの持つストレージへのビューを提供し、そしてエンコード可能型のエンコードされたプロパティをキー流儀で保持するために使われます。

source: A type that provides a view into an encoder’s storage and is used to hold the encoded properties of an encodable type sequentially, without keys.
ja: ある型で、あるエンコーダの持つストレージへのビューを提供し、そしてエンコード可能型のエンコードされたプロパティを順次的に、キーなしで保持するために使われます。

source: A type that provides mathematical set operations.
ja: 数学的な集合演算を提供する型。

source: A type that provides sequential, iterated access to its elements.
ja: 順次的な、繰り返されるアクセスをそれの要素に提供するある型。

source: A type that provides the collection’s iteration interface and encapsulates its iteration state.
ja: そのコレクションの持つ反復インターフェイスを提供してそれの反復状態をカプセル化するある型。

source: A type that provides the sequence’s iteration interface and encapsulates its iteration state.
ja: そのシーケンスの持つ反復インターフェイスを提供してそれの反復状態をカプセル化するある型。

source: A type that provides uniformly distributed random data.
ja: 一様分布無作為データを提供する型。
